app/views/people/index.html.erb

SELECT "people".* FROM "people"
---
      <p>
        <%= link_to "#{person.first_name} #{person.last_name}", "people/show/#{person.id}" %>