app/views/people/show_tasks.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."person_id" = ? AND ("tasks"."date_completed" IS NOT NULL)  [["person_id", 3]]
---
  <tbody>
    <% @person.tasks.where(date_completed: nil).each do |task| %>