app/controllers/tasks_controller.rb

  def index
    @all_tasks     = Task.all
---
SELECT "tasks".* FROM "tasks"

  def create
    Task.create(create_params[:task])
---
INSERT INTO "tasks" ("name", "description", "person_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "go to bed"], ["description", "right now"], ["person_id", 4], ["created_at", "2015-06-23 05:53:43.793259"], ["updated_at", "2015-06-23 05:53:43.793259"]]

    task = Task.find(params[:id])
    if task.date_completed == nil
      task.update(date_completed: Time.now)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "tasks" SET "date_completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["date_completed", nil], ["updated_at", "2015-06-23 05:49:31.544342"], ["id", 1]]

  def update
    Task.find(params[:id]).update(create_params[:task])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "tasks" SET "person_id" = ?, "date_completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["person_id", 1], ["date_completed", nil], ["updated_at", "2015-06-23 05:50:54.950777"], ["id", 1]]

  def confirm_delete
    @task          = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]

  def destroy
    @task = Task.find(params["id"])
    @task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]